; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-97)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity v4 c3)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity v7 c3)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l9)
    (at p2 l8)
    (at p3 l6)
    (at p4 l5)
    (at p5 l15)
    (at p6 l6)
    (at p7 l11)
    (at p8 l7)
    (at p9 l3)
    (at p10 l16)
    (at p11 l3)
    (at p12 l5)
    (at p13 l8)
    (at p14 l5)
    (at p15 l11)
    (at p16 l1)
    (at p17 l12)
    (at v1 l8)
    (at v2 l2)
    (at v3 l5)
    (at v4 l9)
    (at v5 l14)
    (at v6 l5)
    (at v7 l10)
    (road l3 l4)
    (road l4 l3)
    (road l9 l2)
    (road l3 l16)
    (road l5 l7)
    (road l8 l3)
    (road l9 l11)
    (road l15 l5)
    (road l12 l3)
    (road l3 l6)
    (road l3 l12)
    (road l8 l5)
    (road l5 l15)
    (road l8 l14)
    (road l16 l3)
    (road l1 l8)
    (road l2 l16)
    (road l6 l13)
    (road l4 l10)
    (road l3 l8)
    (road l14 l8)
    (road l5 l8)
    (road l8 l1)
    (road l10 l4)
    (road l11 l9)
    (road l16 l2)
    (road l2 l9)
    (road l13 l6)
    (road l7 l5)
    (road l6 l3)
    (road l12 l15)
    (road l15 l12)
    (road l11 l13)
    (road l13 l11)
    (road l2 l12)
    (road l12 l2)
    (road l6 l8)
    (road l8 l6)
    (road l1 l9)
    (road l9 l1)
    (road l1 l7)
    (road l7 l1)
    (road l13 l14)
    (road l14 l13)
    (road l6 l10)
    (road l10 l6)
    (road l1 l3)
    (road l3 l1)
    (road l2 l8)
    (road l8 l2)
    (road l11 l15)
    (road l15 l11)
    (road l10 l13)
    (road l13 l10)
    (road l11 l12)
    (road l12 l11)
    (road l2 l11)
    (road l11 l2)
    (road l3 l15)
    (road l15 l3)
    (road l2 l13)
    (road l13 l2)
    (road l1 l4)
    (road l4 l1)
    (road l1 l5)
    (road l5 l1)
    (road l9 l14)
    (road l14 l9)
    )
 (:goal (and 
(at p1 l11)
(at p2 l11)
(at p3 l16)
(at p4 l16)
(at p5 l3)
))
)

; plan
1. (pick-up v3 l5 p4 c1 c2)
   deleted: (at p4 l5) (capacity v3 c2)
   added: (in p4 v3) (capacity v3 c1)
   goals met: 0 of 5
2. (drive v3 l5 l15)
   deleted: (at v3 l5)
   added: (at v3 l15)
   goals met: 0 of 5
3. (pick-up v3 l15 p5 c0 c1)
   deleted: (at p5 l15) (capacity v3 c1)
   added: (in p5 v3) (capacity v3 c0)
   goals met: 0 of 5
4. (drive v3 l15 l3)
   deleted: (at v3 l15)
   added: (at v3 l3)
   goals met: 0 of 5
5. (drop v3 l3 p5 c0 c1)
   deleted: (in p5 v3) (capacity v3 c0)
   added: (at p5 l3) (capacity v3 c1)
   goals met: 1 of 5
6. (pick-up v4 l9 p1 c2 c3)
   deleted: (at p1 l9) (capacity v4 c3)
   added: (in p1 v4) (capacity v4 c2)
   goals met: 1 of 5
7. (drive v4 l9 l11)
   deleted: (at v4 l9)
   added: (at v4 l11)
   goals met: 1 of 5
8. (drop v4 l11 p1 c2 c3)
   deleted: (in p1 v4) (capacity v4 c2)
   added: (at p1 l11) (capacity v4 c3)
   goals met: 2 of 5
9. (pick-up v1 l8 p2 c0 c1)
   deleted: (at p2 l8) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 2 of 5
10. (drive v1 l8 l2)
   deleted: (at v1 l8)
   added: (at v1 l2)
   goals met: 2 of 5
11. (drive v1 l2 l11)
   deleted: (at v1 l2)
   added: (at v1 l11)
   goals met: 2 of 5
12. (drop v1 l11 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l11) (capacity v1 c1)
   goals met: 3 of 5
13. (drive v3 l3 l6)
   deleted: (at v3 l3)
   added: (at v3 l6)
   goals met: 3 of 5
14. (pick-up v3 l6 p3 c0 c1)
   deleted: (at p3 l6) (capacity v3 c1)
   added: (in p3 v3) (capacity v3 c0)
   goals met: 3 of 5
15. (drive v3 l6 l3)
   deleted: (at v3 l6)
   added: (at v3 l3)
   goals met: 3 of 5
16. (drive v3 l3 l16)
   deleted: (at v3 l3)
   added: (at v3 l16)
   goals met: 3 of 5
17. (drop v3 l16 p3 c0 c1)
   deleted: (in p3 v3) (capacity v3 c0)
   added: (at p3 l16) (capacity v3 c1)
   goals met: 4 of 5
18. (drop v3 l16 p4 c1 c2)
   deleted: (in p4 v3) (capacity v3 c1)
   added: (at p4 l16) (capacity v3 c2)
   goals met: 5 of 5
